; domain
(define (domain ham-path)
    (:predicates (visited ?x) (edge ?x ?y) (at ?x))
    (:action walk
     :parameters (?x ?y)
     :precondition (and (at ?x) (edge ?x ?y) (not (visited ?y)))
     :effect (and (at ?y) (visited ?y) (not (at ?x)))
    )
)

; problem
(define (problem ham-path-2)
    (:domain ham-path)
    (:objects a b c d e f g h i j k)
    (:init (edge a b) (edge a d) (edge a e)
           (edge b c) (edge b f) (edge b i) (edge b a)
           (edge c b) (edge c d) (edge c k)
           (edge d a) (edge d g) (edge d j) (edge d c)
           (edge e a) (edge e f) (edge e g)
           (edge f e) (edge f b) (edge f h)
           (edge g e) (edge g d) (edge g h)
           (edge h g) (edge h f) (edge h i) (edge h j)
           (edge i b) (edge i k) (edge i h)
           (edge j d) (edge j k) (edge j h)
           (edge k i) (edge k c) (edge k j)
           (at a)
           (visited a)
    )
    (:goal (and (visited a)
                (visited b)
                (visited c)
                (visited d)
                (visited e)
                (visited f)
                (visited g)
                (visited h)
                (visited i)
                (visited j)
                (visited k)
                (at c)
           )
    )
)

; plan
1. (walk a d)
   deleted: (at a)
   added: (at d) (visited d)
   goals met: 2 of 12
2. (walk d j)
   deleted: (at d)
   added: (at j) (visited j)
   goals met: 3 of 12
3. (walk j h)
   deleted: (at j)
   added: (at h) (visited h)
   goals met: 4 of 12
4. (walk h g)
   deleted: (at h)
   added: (at g) (visited g)
   goals met: 5 of 12
5. (walk g e)
   deleted: (at g)
   added: (at e) (visited e)
   goals met: 6 of 12
6. (walk e f)
   deleted: (at e)
   added: (at f) (visited f)
   goals met: 7 of 12
7. (walk f b)
   deleted: (at f)
   added: (at b) (visited b)
   goals met: 8 of 12
8. (walk b i)
   deleted: (at b)
   added: (at i) (visited i)
   goals met: 9 of 12
9. (walk i k)
   deleted: (at i)
   added: (at k) (visited k)
   goals met: 10 of 12
10. (walk k c)
   deleted: (at k)
   added: (at c) (visited c)
   goals met: 12 of 12
